In [37]:
import numpy as np
import pandas as pd
import os
for dirname , _ , filenames in os.walk(r"C:\Users\HP\Downloads\titanic"):
    for filename in filenames:
        print(os.path.join(dirname,filename))
os.getcwd()

C:\Users\HP\Downloads\titanic\gender_submission.csv
C:\Users\HP\Downloads\titanic\test.csv
C:\Users\HP\Downloads\titanic\train.csv

'C:\\Users\\HP'

In [41]:
train_data = pd.read_csv('train.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
test_data = pd.read_csv('test.csv')
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [51]:
women = train_data.loc[train_data.Sex == 'female']['Survived']
#clearly this approach works ..
rate_women = sum(women)/len(women)
print(f'the survival rate of women was {rate_women}')

the survival rate of women was 0.7420382165605095

In [53]:
men = train_data.loc[train_data.Sex == 'male']['Survived']
#for mens.
rate_men = sum(men)/len(men)
print(f'the survival rate of men was {rate_men}')

the survival rate of men was 0.18890814558058924

In [65]:
from sklearn.ensemble import RandomForestClassifier
y = train_data['Survived']
features = ["Pclass" , "Sex" , "SibSp" , "Parch"]
X = pd.get_dummies(train_data[features])
X_test = pd.get_dummies(test_data[features])
model = RandomForestClassifier(n_estimators = 100 , max_depth = 5 , random_state = 1)
model.fit(X,y)
arr = model.predict(X_test)
print(sum(arr)/ len(arr))
output = pd.DataFrame({
'passengerId': test_data.PassengerId , "survived": arr})

0.35406698564593303